  //1
  var kgCost = 200;//обьявляем переменную
  console.log(' Цена 1 кг конфет - ' + kgCost + ' рублей');//выводим цену за 1
  for (var d = 1; d <= 2; d+=0.2) {
  console.log('ЦЕНА за ' + d.toFixed(1) + ' килограмм ' + kgCost * d.toFixed(1) + ' рублей');//выводим цену до 2 кг toFixed(1)-значит что берем измененное значение
  };

  //2

      // Объявляем переменную для хранения значения, введённой в модальное окно
      // + перед prompt нужен для преобразования строки в число
  var N = +prompt('Введите целое число');

      // Создаём цикл для проверки для деления на 3
      // Пока работает условие N > 3, цикл будет выполняться
  while(N > 3){
        N = N / 3;
      }

      // Проверяем, соответсвует ли число N условию и выводим нужный результат
  if(N == 3) console.log('TRUE');
  else console.log('FALSE');
